src/hub/tests/unit/fixtures/stripe_in_test2.json

{
  "id": "in_test1",
  "object": "invoice",
  "account_country": "US",
  "account_name": "Mozilla Corporation",
  "amount_due": 1000,
  "amount_paid": 1000,
  "amount_remaining": 0,
  "application_fee_amount": null,
  "attempt_count": 1,
  "attempted": true,
  "auto_advance": false,
  "billing": "charge_automatically",
  "billing_reason": "subscription_create",
  "charge": null,
  "collection_method": "charge_automatically",
  "created": 1555354567,
  "currency": "usd",
  "custom_fields": null,
  "customer": "cus_test1",
  "customer_address": null,
  "customer_email": "test_fixture@tester.com",
  "customer_name": null,
  "customer_phone": null,
  "customer_shipping": null,
  "customer_tax_exempt": "none",
  "customer_tax_ids": [],
  "default_payment_method": null,
  "default_source": null,
  "default_tax_rates": [],
  "description": null,
  "discount": null,
  "due_date": null,
  "ending_balance": 0,
  "footer": null,
  "hosted_invoice_url": "https://pay.stripe.com/invoice/invst_ZPQW1BXsP9LEjkKf4oXxhNMeeS",
  "invoice_pdf": "https://pay.stripe.com/invoice/invst_ZPQW1BXsP9LEjkKf4oXxhNMeeS/pdf",
  "lines": {
    "data": [
      {
        "id": "sli_2182b279422cba",
        "object": "line_item",
        "amount": 1000,
        "currency": "usd",
        "description": "1 Moz-Sub × Moz_Sub (at $10.00 / month)",
        "discountable": true,
        "livemode": false,
        "metadata": {},
        "period": {
          "end": 1572905353,
          "start": 1570226953
        },
        "plan": {},
        "proration": false,
        "quantity": 1,
        "subscription": "sub_FkbsOxUMt9qxhO",
        "subscription_item": "si_FkbsnTorDMAHh3",
        "tax_amounts": [],
        "tax_rates": [],
        "type": "subscription"
      }
    ],
    "has_more": false,
    "object": "list",
    "url": "/v1/invoices/in_test1/lines"
  },
  "livemode": false,
  "metadata": {},
  "next_payment_attempt": null,
  "number": null,
  "paid": true,
  "payment_intent": "pi_1EPZyNJNcmPzuWtR9U3SsJ4w",
  "period_end": 1555354567,
  "period_start": 1555354567,
  "post_payment_credit_notes_amount": 0,
  "pre_payment_credit_notes_amount": 0,
  "receipt_number": null,
  "starting_balance": 0,
  "statement_descriptor": null,
  "status": "paid",
  "status_transitions": {
    "finalized_at": 1555354567,
    "marked_uncollectible_at": null,
    "paid_at": 1555354568,
    "voided_at": null
  },
  "subscription": "sub_test2",
  "subtotal": 1000,
  "tax": null,
  "tax_percent": null,
  "total": 1000,
  "total_tax_amounts": [],
  "webhooks_delivered_at": 1555354569
}