src/hub/tests/unit/fixtures/stripe_sub_updated_event_cancel.json

{
  "id": "evt_1FXDCFJNcmPzuWtRrogbWpRZ",
  "object": "event",
  "api_version": "2019-03-14",
  "created": 1571949975,
  "data": {
    "object": {
      "id": "sub_FCUzkHmNY3Mbj1",
      "object": "subscription",
      "application_fee_percent": null,
      "billing": "charge_automatically",
      "billing_cycle_anchor": 1559767571,
      "billing_thresholds": null,
      "cancel_at": null,
      "cancel_at_period_end": true,
      "canceled_at": null,
      "collection_method": "charge_automatically",
      "created": 1559767571,
      "current_period_end": 1572036371,
      "current_period_start": 1571949971,
      "customer": "cus_FCUzOhOp9iutWa",
      "days_until_due": null,
      "default_payment_method": null,
      "default_source": null,
      "default_tax_rates": [],
      "discount": null,
      "ended_at": null,
      "items": {
        "object": "list",
        "data": [
          {
            "id": "si_FCUzTOlS7Ltzbr",
            "object": "subscription_item",
            "billing_thresholds": null,
            "created": 1559767572,
            "metadata": {},
            "plan": {
              "id": "plan_F4G9jB3x5i6Dpj",
              "object": "plan",
              "active": true,
              "aggregate_usage": null,
              "amount": 100,
              "amount_decimal": "100",
              "billing_scheme": "per_unit",
              "created": 1557867224,
              "currency": "usd",
              "interval": "day",
              "interval_count": 1,
              "livemode": false,
              "metadata": {},
              "nickname": "Daily Subscription",
              "product": "prod_EtMczoDntN9YEa",
              "tiers": null,
              "tiers_mode": null,
              "transform_usage": null,
              "trial_period_days": null,
              "usage_type": "licensed"
            },
            "quantity": 1,
            "subscription": "sub_FCUzkHmNY3Mbj1",
            "tax_rates": []
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/subscription_items?subscription=sub_FCUzkHmNY3Mbj1"
      },
      "latest_invoice": "in_1FXDCFJNcmPzuWtRT9U5Xvcz",
      "livemode": false,
      "metadata": {},
      "next_pending_invoice_item_invoice": null,
      "pending_invoice_item_interval": null,
      "pending_setup_intent": null,
      "plan": {
        "id": "plan_F4G9jB3x5i6Dpj",
        "object": "plan",
        "active": true,
        "aggregate_usage": null,
        "amount": 100,
        "amount_decimal": "100",
        "billing_scheme": "per_unit",
        "created": 1557867224,
        "currency": "usd",
        "interval": "day",
        "interval_count": 1,
        "livemode": false,
        "metadata": {},
        "nickname": "Daily Subscription",
        "product": "prod_EtMczoDntN9YEa",
        "tiers": null,
        "tiers_mode": null,
        "transform_usage": null,
        "trial_period_days": null,
        "usage_type": "licensed"
      },
      "quantity": 1,
      "schedule": null,
      "start": 1559767571,
      "start_date": 1559767571,
      "status": "active",
      "tax_percent": null,
      "trial_end": null,
      "trial_start": null
    },
    "previous_attributes": {
      "cancel_at_period_end": false
    }
  },
  "livemode": false,
  "pending_webhooks": 1,
  "request": {
    "id": null,
    "idempotency_key": null
  },
  "type": "customer.subscription.updated"
}